taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC4000_DFP.2.7.1.pdsc
      <!-- ************************  Subfamily 'XMC4100'  **************************** -->
      <subFamily DsubFamily="XMC4100 Series">
        <feature type="DMA"           n="8"/>       
        <feature type="ComOther"      n="4"                         name="Universal Serial Interface"/>
      
      <!-- ******************************  XMC4100-F64x128  ****************************** -->
      <device Dname="XMC4100-F64x128">
        <processor Dclock="80000000"/>
        <compile header="Device/XMC4100_series/Include/XMC4100.h"  define="XMC4100_F64x128"/>
        <debug      svd="SVD/XMC4100.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x20000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4200_4100_128.FLM" start="0x0C000000" size="0x20000"                 default="1"/>
        <algorithm  name="Flash/XMC4200_4100c_128.FLM" start="0x08000000" size="0x20000"                default="1"/>
        <book    name="Documents/xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4100 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4100_XMC4200-DS-v01_03-EN.pdf" title="XMC4100 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4100_XMC4200_AB_Errata_Sheet-ES-v01_03-EN.pdf"  title="XMC4100 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="ADC"           n="10"       m="12"/>
        <feature type="CAN"           n="2"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="31"/>
        <feature type="QFP"           n="64"/>      
      </device>

      <!-- ******************************  XMC4100-Q48x128  ****************************** -->
      <device Dname="XMC4100-Q48x128">
        <processor Dclock="80000000"/>
        <compile header="Device/XMC4100_series/Include/XMC4100.h"  define="XMC4100_Q48x128"/>
        <debug      svd="SVD/XMC4100.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x20000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4200_4100_128.FLM" start="0x0C000000" size="0x20000"                 default="1"/>
        <algorithm  name="Flash/XMC4200_4100c_128.FLM" start="0x08000000" size="0x20000"                default="1"/>
        <book    name="Documents/xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4100 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4100_XMC4200-DS-v01_03-EN.pdf"       title="XMC4100 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4100_XMC4200_AB_Errata_Sheet-ES-v01_03-EN.pdf"          title="XMC4100 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="CAN"           n="2"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="21"/>
        <feature type="QFN"           n="48"/>      
      </device>

      <!-- ******************************  XMC4104-F64x64  ****************************** -->
      <device Dname="XMC4104-F64x64">
        <processor Dclock="80000000"/>
        <compile header="Device/XMC4100_series/Include/XMC4100.h"  define="XMC4104_F64x64"/>
        <debug      svd="SVD/XMC4100.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4200_4100_64.FLM" start="0x0C000000" size="0x10000"                  default="1"/>
        <algorithm  name="Flash/XMC4200_4100c_64.FLM" start="0x08000000" size="0x10000"                 default="1"/>
        <book    name="Documents/xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4100 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4100_XMC4200-DS-v01_03-EN.pdf"       title="XMC4100 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4100_XMC4200_AB_Errata_Sheet-ES-v01_03-EN.pdf"          title="XMC4100 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>   
        <feature type="ADC"           n="10"       m="12"/>
        <feature type="IOs"           n="35"/>
        <feature type="QFP"           n="64"/>          
      </device>

      <!-- ******************************  XMC4104-Q48x64  ****************************** -->
      <device Dname="XMC4104-Q48x64">
        <processor Dclock="80000000"/>
        <compile header="Device/XMC4100_series/Include/XMC4100.h"  define="XMC4104_Q48x64"/>
        <debug      svd="SVD/XMC4100.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4200_4100_64.FLM" start="0x0C000000" size="0x10000"                  default="1"/>
        <algorithm  name="Flash/XMC4200_4100c_64.FLM" start="0x08000000" size="0x10000"                 default="1"/>
        <book    name="Documents/xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4100 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4100_XMC4200-DS-v01_03-EN.pdf"       title="XMC4100 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4100_XMC4200_AB_Errata_Sheet-ES-v01_03-EN.pdf"          title="XMC4100 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>  
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="IOs"           n="21"/>
        <feature type="QFN"           n="48"/>          
      </device>

      <!-- ******************************  XMC4104-F64x128  ****************************** -->
      <device Dname="XMC4104-F64x128">
        <processor Dclock="80000000"/>
        <compile header="Device/XMC4100_series/Include/XMC4100.h"  define="XMC4104_F64x128"/>
        <debug      svd="SVD/XMC4100.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x20000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4200_4100_128.FLM" start="0x0C000000" size="0x20000"                 default="1"/>
        <algorithm  name="Flash/XMC4200_4100c_128.FLM" start="0x08000000" size="0x20000"                default="1"/>
        <book    name="Documents/xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4100 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4100_XMC4200-DS-v01_03-EN.pdf"       title="XMC4100 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4100_XMC4200_AB_Errata_Sheet-ES-v01_03-EN.pdf"          title="XMC4100 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>    
        <feature type="ADC"           n="10"       m="12"/>
        <feature type="IOs"           n="35"/>
        <feature type="QFP"           n="64"/>          
      </device>

