taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC4000_DFP.2.7.1.pdsc
    <example name="Network Telnet Server" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Kit/Middleware/Network/Telnet_Server" version="1.0.2">
      <description> Telnet Server using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>    
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>   
      </attributes>
    </example>  

    <example name="Network FTP Server" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Kit/Middleware/Network/FTP_Server" version="1.0.0">
      <description> FTP Server using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="FTP_Server.uvprojx"/>
      </project>
      <attributes>    
        <component Cclass="Network" Cgroup="Service" Csub="FTP Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>FTP</keyword>   
      </attributes>
    </example>  
 
     <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Kit/Middleware/USB/Device/MassStorage" version="1.0.2">
      <description> USB MSC example using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example> 

    <example name="USB Human Interface Device" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Kit/Middleware/USB/Device/HID" version="1.0.2">
      <description> USB HID example using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Relax_USB_HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>
    
    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Kit/Middleware/USB/Device/VirtualCOM" version="1.0.2">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="CDC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>  

    <example name="USB Device Datalogger" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Kit/Middleware/USB/Device/Datalogger" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Datalogger.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>  

    <!-- Infineon XMC4500 Relax Lite Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Lite Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Lite Kit/Middleware/USB/Device/MassStorage" version="1.0.2">
      <description> USB MSC example using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example> 

    <example name="USB Human Interface Device" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Lite Kit/Middleware/USB/Device/HID" version="1.0.2">
      <description> USB HID example using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Relax_USB_HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>

    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Lite Kit/Middleware/USB/Device/VirtualCOM" version="1.0.2">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>  
 
    <!-- Infineon XMC4700 Relax Lite Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4700 Relax Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4700 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example> 

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4700 Relax Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC4700 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

