taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC4000_DFP.2.7.1.pdsc
    <!-- DAC -->    
    <example name="DAC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/DAC/DAC_SINE">
      <description>XMClib DAC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/dac_sine.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DAC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>   

    <example name="DAC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/DAC/DAC_SINE">
      <description>XMClib DAC example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/dac_sine.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DAC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- DMA -->    
    <example name="DMA" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/DMA/DMA_M2M">
      <description>XMClib DMA example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/dma_m2m.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DMA"/>       
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <!-- ERU -->    
    <example name="ERU" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/ERU/ERU_EXTINT"> 
      <description>XMClib ERU external interrupt example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/eru_extint.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="ERU"/>  
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>               
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- FCE -->    
    <example name="FCE" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/FCE/FCE_CRC">
      <description>XMClib FCE example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/fce_crc.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FCE"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- FLASH -->    
    <example name="FLASH" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/FLASH/FLASH_PROGRAM"> 
      <description>XMClib FLASH example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/flash_program.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FLASH"/>
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- GPIO -->    
    <example name="GPIO" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/GPIO/GPIO_TOGGLE"> 
      <description>XMClib GPIO toggle example flashes the leds of the board with a periodic rate</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/gpio_toggle.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example>                    

    <!-- HRPWM_CSG -->    
    <example name="HRPWM_CSG" doc="Readme.txt" folder="Device/XMClib/examples/XMC4400_series/HRPWM/HRPWM_CSG"> 
      <description>XMClib High Resolution PWM (HAPWM) driver example - CSG </description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/hrpwm_csg.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="HRPWM"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <!-- HRPWM_HRC -->    
    <example name="HRPWM_HRC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4400_series/HRPWM/HRPWM_HRC"> 
      <description>XMClib High Resolution PWM (HAPWM) driver example - HRC </description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/hrpwm_hrc.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="HRPWM"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 
        
    <!-- I2C -->    
    <example name="I2C" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/I2C/I2C_TRANSFER">
      <description>XMClib I2C example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/i2c_transfer.uvprojx"/>     
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="I2C"/>   
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>              
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <!-- LEDTS -->    
    <example name="LEDTS" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/LEDTS/LEDTS_TOUCH">
      <description>XMClib LEDTS example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ledts_touch.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>         
        <category>LLD Examples</category>
      </attributes>
    </example>

