taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC4000_DFP.2.7.1.pdsc
    <!-- RTC -->    
    <example name="RTC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/RTC/RTC_ALARM">
      <description>XMClib RTC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/rtc_alarm.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="RTC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- SPI -->
    <example name="SPI" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/SPI/SPI_TRANSMIT">
      <description>XMClib SPI example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/spi_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>          
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- UART -->
    <example name="UART" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/UART/UART_TRANSMIT">
      <description>XMClib UART example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- VADC -->
    <example name="VADC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/VADC/VADC_MEASUREMENT">
      <description>XMClib VADC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="VADC" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/VADC/VADC_MEASUREMENT">
      <description>XMClib VADC example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- WDT -->
    <example name="WDT" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/WDT/WDT_FEED">
      <description>XMClib WDT example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/wdt_feed.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- EBU -->    
    <example name="EBU" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/EBU/EBU_SDRAM">
      <description>XMClib EBU example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45B)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ebu_sdram.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="EBU"/>
        <category>LLD Examples</category>
      </attributes>
    </example>  
    
  </examples>
  
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="XMC4 CMSIS">
      <description>System Startup for Infineon XMC4000 family</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STARTUP
      </RTE_Components_h>
      
      <files>
        <!--  include folder -->
        <file category="include" name="Device/XMC4100_series/Include/" condition="XMC41xx"/>
        <file category="include" name="Device/XMC4200_series/Include/" condition="XMC42xx"/>
        <file category="include" name="Device/XMC4300_series/Include/" condition="XMC43xx"/>
        <file category="include" name="Device/XMC4400_series/Include/" condition="XMC44xx"/>
        <file category="include" name="Device/XMC4500_series/Include/" condition="XMC45xx"/>
        <file category="include" name="Device/XMC4700_series/Include/" condition="XMC47xx"/>
        <file category="include" name="Device/XMC4800_series/Include/" condition="XMC48xx"/>
        
        <!--  device header file -->
        <file category="header" name="Device/XMC4100_series/Include/XMC4100.h" version="1.5.3" condition="XMC41xx"/>
        <file category="header" name="Device/XMC4200_series/Include/XMC4200.h" version="1.5.3" condition="XMC42xx"/>
        <file category="header" name="Device/XMC4300_series/Include/XMC4300.h" version="1.0.4" condition="XMC43xx"/>
        <file category="header" name="Device/XMC4400_series/Include/XMC4400.h" version="1.5.4" condition="XMC44xx"/>
        <file category="header" name="Device/XMC4500_series/Include/XMC4500.h" version="1.5.4" condition="XMC45xx"/>
        <file category="header" name="Device/XMC4700_series/Include/XMC4700.h" version="1.0.4" condition="XMC47xx"/>
        <file category="header" name="Device/XMC4800_series/Include/XMC4800.h" version="1.1.6" condition="XMC48xx"/>
        
        <!-- system file -->
        <file category="source" name="Device/XMC4100_series/Source/system_XMC4100.c" version="3.2.2" attr="config" condition="XMC41xx"/>
        <file category="source" name="Device/XMC4200_series/Source/system_XMC4200.c" version="3.1.1" attr="config" condition="XMC42xx"/>
        <file category="source" name="Device/XMC4300_series/Source/system_XMC4300.c" version="1.0.2" attr="config" condition="XMC43xx"/>
        <file category="source" name="Device/XMC4400_series/Source/system_XMC4400.c" version="3.1.1" attr="config" condition="XMC44xx"/>
        <file category="source" name="Device/XMC4500_series/Source/system_XMC4500.c" version="3.1.1" attr="config" condition="XMC45xx"/>
        <file category="source" name="Device/XMC4700_series/Source/system_XMC4700.c" version="1.0.2" attr="config" condition="XMC47xx"/>
        <file category="source" name="Device/XMC4800_series/Source/system_XMC4800.c" version="1.0.2" attr="config" condition="XMC48xx"/>
        
        <!-- startup files -->
        <file category="source" name="Device/XMC4100_series/Source/ARM/startup_XMC4100.s" version="1.4.0" attr="config" condition="XMC4100_ARMCC"/>
        <file category="source" name="Device/XMC4100_series/Source/ARM/startup_XMC4104.s" version="1.5.0" attr="config" condition="XMC4104_ARMCC"/>
        <file category="source" name="Device/XMC4100_series/Source/ARM/startup_XMC4108.s" version="1.5.0" attr="config" condition="XMC4108_ARMCC"/>
        <file category="source" name="Device/XMC4200_series/Source/ARM/startup_XMC4200.s" version="1.4.0" attr="config" condition="XMC42xx_ARMCC"/>
        <file category="source" name="Device/XMC4300_series/Source/ARM/startup_XMC4300.s" version="1.1.0" attr="config" condition="XMC43xx_ARMCC"/>
        <file category="source" name="Device/XMC4400_series/Source/ARM/startup_XMC4400.s" version="1.5.0" attr="config" condition="XMC4400_ARMCC"/>
        <file category="source" name="Device/XMC4400_series/Source/ARM/startup_XMC4402.s" version="1.5.0" attr="config" condition="XMC4402_ARMCC"/>
        <file category="source" name="Device/XMC4500_series/Source/ARM/startup_XMC4500.s" version="1.7.0" attr="config" condition="XMC4500_ARMCC"/>
        <file category="source" name="Device/XMC4500_series/Source/ARM/startup_XMC4502.s" version="1.8.0" attr="config" condition="XMC4502_ARMCC"/>
        <file category="source" name="Device/XMC4500_series/Source/ARM/startup_XMC4504.s" version="1.8.0" attr="config" condition="XMC4504_ARMCC"/>
        <file category="source" name="Device/XMC4700_series/Source/ARM/startup_XMC4700.s" version="1.0.0" attr="config" condition="XMC47xx_ARMCC"/>
        <file category="source" name="Device/XMC4800_series/Source/ARM/startup_XMC4800.s" version="1.0.0" attr="config" condition="XMC48xx_ARMCC"/>

        <file category="source" name="Device/XMC4100_series/Source/GCC/startup_XMC4100.S" version="1.0.0" attr="config" condition="XMC4100_GCC"/>
        <file category="source" name="Device/XMC4100_series/Source/GCC/startup_XMC4104.S" version="1.1.0" attr="config" condition="XMC4104_GCC"/>
        <file category="source" name="Device/XMC4100_series/Source/GCC/startup_XMC4108.S" version="1.1.0" attr="config" condition="XMC4108_GCC"/>
        <file category="source" name="Device/XMC4200_series/Source/GCC/startup_XMC4200.S" version="1.0.0" attr="config" condition="XMC42xx_GCC"/>
        <file category="source" name="Device/XMC4300_series/Source/GCC/startup_XMC4300.S" version="1.1.0" attr="config" condition="XMC43xx_GCC"/>
        <file category="source" name="Device/XMC4400_series/Source/GCC/startup_XMC4400.S" version="1.0.0" attr="config" condition="XMC4400_GCC"/>
        <file category="source" name="Device/XMC4400_series/Source/GCC/startup_XMC4402.S" version="1.1.0" attr="config" condition="XMC4402_GCC"/>
        <file category="source" name="Device/XMC4500_series/Source/GCC/startup_XMC4500.S" version="1.20.0" attr="config" condition="XMC4500_GCC"/>
        <file category="source" name="Device/XMC4500_series/Source/GCC/startup_XMC4502.S" version="1.21.0" attr="config" condition="XMC4502_GCC"/>
        <file category="source" name="Device/XMC4500_series/Source/GCC/startup_XMC4504.S" version="1.21.0" attr="config" condition="XMC4504_GCC"/>
        <file category="source" name="Device/XMC4700_series/Source/GCC/startup_XMC4700.S" version="1.1.0" attr="config" condition="XMC47xx_GCC"/>
        <file category="source" name="Device/XMC4800_series/Source/GCC/startup_XMC4800.S" version="1.1.0" attr="config" condition="XMC48xx_GCC"/>
        
        <file category="source" name="Device/XMC4100_series/Source/IAR/startup_XMC4100.s" version="1.2.0" attr="config" condition="XMC4100_IAR"/>
        <file category="source" name="Device/XMC4100_series/Source/IAR/startup_XMC4104.s" version="1.3.0" attr="config" condition="XMC4104_IAR"/>
        <file category="source" name="Device/XMC4100_series/Source/IAR/startup_XMC4108.s" version="1.3.0" attr="config" condition="XMC4108_IAR"/>
        <file category="source" name="Device/XMC4200_series/Source/IAR/startup_XMC4200.s" version="1.2.0" attr="config" condition="XMC42xx_IAR"/>
        <file category="source" name="Device/XMC4300_series/Source/IAR/startup_XMC4300.s" version="1.0.0" attr="config" condition="XMC43xx_IAR"/>
        <file category="source" name="Device/XMC4400_series/Source/IAR/startup_XMC4400.s" version="1.2.0" attr="config" condition="XMC4400_IAR"/>
        <file category="source" name="Device/XMC4400_series/Source/IAR/startup_XMC4402.s" version="1.3.0" attr="config" condition="XMC4402_IAR"/>
        <file category="source" name="Device/XMC4500_series/Source/IAR/startup_XMC4500.s" version="1.2.0" attr="config" condition="XMC4500_IAR"/>
        <file category="source" name="Device/XMC4500_series/Source/IAR/startup_XMC4502.s" version="1.3.0" attr="config" condition="XMC4502_IAR"/>
        <file category="source" name="Device/XMC4500_series/Source/IAR/startup_XMC4504.s" version="1.3.0" attr="config" condition="XMC4504_IAR"/>
        <file category="source" name="Device/XMC4700_series/Source/IAR/startup_XMC4700.s" version="1.0.0" attr="config" condition="XMC47xx_IAR"/>
        <file category="source" name="Device/XMC4800_series/Source/IAR/startup_XMC4800.s" version="1.0.0" attr="config" condition="XMC48xx_IAR"/>

