taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC4000_DFP.2.7.1.pdsc
        <!-- linker files -->
        <file category="linkerScript" name="Device/XMC4100_series/Source/GCC/XMC4100x128.ld"  version="1.7.0" condition="XMC4100_128_GCC"/>
        <file category="linkerScript" name="Device/XMC4100_series/Source/GCC/XMC4104x128.ld"  version="1.7.0" condition="XMC4104_128_GCC"/>
        <file category="linkerScript" name="Device/XMC4100_series/Source/GCC/XMC4104x64.ld"   version="1.7.0" condition="XMC4104_64_GCC"/>
        <file category="linkerScript" name="Device/XMC4100_series/Source/GCC/XMC4108x64.ld"   version="1.7.0" condition="XMC4108_64_GCC"/>
        <file category="linkerScript" name="Device/XMC4200_series/Source/GCC/XMC4200x256.ld"  version="1.7.0" condition="XMC42xx_256_GCC"/>
        <file category="linkerScript" name="Device/XMC4300_series/Source/GCC/XMC4300x256.ld"  version="1.1.0" condition="XMC43xx_256_GCC"/>
        <file category="linkerScript" name="Device/XMC4400_series/Source/GCC/XMC4400x512.ld"  version="1.7.0" condition="XMC4400_512_GCC"/>
        <file category="linkerScript" name="Device/XMC4400_series/Source/GCC/XMC4400x256.ld"  version="1.7.0" condition="XMC4400_256_GCC"/>
        <file category="linkerScript" name="Device/XMC4400_series/Source/GCC/XMC4402x256.ld"  version="1.7.0" condition="XMC4402_256_GCC"/>
        <file category="linkerScript" name="Device/XMC4500_series/Source/GCC/XMC4500x1024.ld" version="1.7.0" condition="XMC4500_1024_GCC"/>
        <file category="linkerScript" name="Device/XMC4500_series/Source/GCC/XMC4500x768.ld"  version="1.7.0" condition="XMC4500_768_GCC"/>
        <file category="linkerScript" name="Device/XMC4500_series/Source/GCC/XMC4502x768.ld"  version="1.7.0" condition="XMC4502_768_GCC"/>
        <file category="linkerScript" name="Device/XMC4500_series/Source/GCC/XMC4504x512.ld"  version="1.7.0" condition="XMC4504_512_GCC"/>
        <file category="linkerScript" name="Device/XMC4700_series/Source/GCC/XMC4700x1536.ld" version="1.2.0" condition="XMC47xx_1536_GCC"/>
        <file category="linkerScript" name="Device/XMC4700_series/Source/GCC/XMC4700x2048.ld" version="1.2.0" condition="XMC47xx_2048_GCC"/>
        <file category="linkerScript" name="Device/XMC4800_series/Source/GCC/XMC4800x1024.ld" version="1.2.0" condition="XMC48xx_1024_GCC"/>
        <file category="linkerScript" name="Device/XMC4800_series/Source/GCC/XMC4800x1536.ld" version="1.2.0" condition="XMC48xx_1536_GCC"/>
        <file category="linkerScript" name="Device/XMC4800_series/Source/GCC/XMC4800x2048.ld" version="1.2.0" condition="XMC48xx_2048_GCC"/>
      </files> 
    </component>
    
    <component Cclass="Device" Cgroup="RTE_Device" Cversion="1.1.0" condition="XMC4 CMSIS">
      <description>RTE Device</description>
      <RTE_Components_h>
        #define RTE_DEVICE
      </RTE_Components_h>  
      <files>
        <file category="include" name="RTE_Driver/"/>   
        <file category="header"  name="RTE_Driver/Config/XMC4200_F64/RTE_Device.h"  version="1.1.0" condition="XMC4100_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4200_Q48/RTE_Device.h"  version="1.1.0" condition="XMC4100_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4104_F64/RTE_Device.h"  version="1.1.0" condition="XMC4104_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4104_Q48/RTE_Device.h"  version="1.1.0" condition="XMC4104_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4108_F64/RTE_Device.h"  version="1.1.0" condition="XMC4108_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4108_Q48/RTE_Device.h"  version="1.1.0" condition="XMC4108_Q48" attr="config"/>
        
        <file category="header"  name="RTE_Driver/Config/XMC4200_F64/RTE_Device.h"  version="1.1.0" condition="XMC4200_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4200_Q48/RTE_Device.h"  version="1.1.0" condition="XMC4200_Q48" attr="config"/>
        
        <file category="header"  name="RTE_Driver/Config/XMC4300_F100/RTE_Device.h" version="1.1.0" condition="XMC4300_F100" attr="config"/>
        
        <file category="header"  name="RTE_Driver/Config/XMC4400_F64/RTE_Device.h"  version="1.1.0" condition="XMC4400_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4400_F100/RTE_Device.h" version="1.1.0" condition="XMC4400_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4402_F64/RTE_Device.h"  version="1.1.0" condition="XMC4402_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4402_F100/RTE_Device.h" version="1.1.0" condition="XMC4402_F100" attr="config"/>
        
        <file category="header"  name="RTE_Driver/Config/XMC4500_F100/RTE_Device.h" version="1.1.0" condition="XMC4500_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4500_F144/RTE_Device.h" version="1.1.0" condition="XMC4500_F144" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4502_F100/RTE_Device.h" version="1.1.0" condition="XMC4502_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4504_F100/RTE_Device.h" version="1.1.0" condition="XMC4504_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4504_F144/RTE_Device.h" version="1.1.0" condition="XMC4504_F144" attr="config"/>
        
        <file category="header"  name="RTE_Driver/Config/XMC4800_E196/RTE_Device.h" version="1.1.0" condition="XMC4700_E196" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4800_F100/RTE_Device.h" version="1.1.0" condition="XMC4700_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4800_F144/RTE_Device.h" version="1.1.0" condition="XMC4700_F144" attr="config"/>

        <file category="header"  name="RTE_Driver/Config/XMC4800_E196/RTE_Device.h" version="1.1.0" condition="XMC4800_E196" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4800_F100/RTE_Device.h" version="1.1.0" condition="XMC4800_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4800_F144/RTE_Device.h" version="1.1.0" condition="XMC4800_F144" attr="config"/>
      </files>
    </component>

    <component Cvendor="Infineon" Cclass="CMSIS" Cgroup="RTOS" Csub="Keil RTX" Cversion="4.80.0" Capiversion="1.0.0" Cvariant="IFX" condition="XMC4 CMSIS">
      <description>CMSIS-RTOS RTX optimized implementation for Infineon XMC4 series not affected by PMU_CM.001 errata</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_CMSIS_RTOS                  /* CMSIS-RTOS */
        #define RTE_CMSIS_RTOS_RTX              /* CMSIS-RTOS Keil RTX */
      </RTE_Components_h>
      <files>
        <!-- CPU independent -->
        <file category="doc" name="CMSIS/RTOS/RTX/index.html"/>
        <file category="header" name="CMSIS/RTOS/RTX/INC/cmsis_os.h"/>
        <file category="source" attr="config"   name="CMSIS/RTOS/RTX/Templates/RTX_Conf_CM.c" version="4.70.1"/>
        
        <!-- RTX templates -->
        <file category="header" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/osObjects.h" select="CMSIS-RTOS 'main' function"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/main.c"      select="CMSIS-RTOS 'main' function"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/MailQueue.c" select="CMSIS-RTOS Mail Queue"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/MemPool.c"   select="CMSIS-RTOS Memory Pool"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/MsgQueue.c"  select="CMSIS-RTOS Message Queue"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/Mutex.c"     select="CMSIS-RTOS Mutex"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/Semaphore.c" select="CMSIS-RTOS Semaphore"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/Thread.c"    select="CMSIS-RTOS Thread"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/Timer.c"     select="CMSIS-RTOS Timer"/>
        <!-- tool-chain specific template file -->
        <file category="source" attr="template" condition="ARMCC" name="CMSIS/RTOS/RTX/SRC/ARM/SVC_Table.s" select="CMSIS-RTOS User SVC"/>
        <file category="source" attr="template" condition="GCC"   name="CMSIS/RTOS/RTX/SRC/GCC/SVC_Table.S" select="CMSIS-RTOS User SVC"/>
        <file category="source" attr="template" condition="IAR"   name="CMSIS/RTOS/RTX/SRC/IAR/SVC_Table.s" select="CMSIS-RTOS User SVC"/>

        <!-- CPU and Compiler dependent -->
        <!-- ARMCC -->
        <file category="library" condition="ARMCC" name="CMSIS/RTOS/RTX/LIB/ARM/RTX_CM4.lib"      src="CMSIS/RTOS/RTX/SRC/ARM"/>
        <!-- GCC -->
        <file category="library" condition="GCC"   name="CMSIS/RTOS/RTX/LIB/GCC/libRTX_CM4.a"     src="CMSIS/RTOS/RTX/SRC/GCC"/>
        <!-- IAR -->
        <file category="library" condition="IAR"   name="CMSIS/RTOS/RTX/LIB/IAR/RTX_CM4.a"        src="CMSIS/RTOS/RTX/SRC/IAR"/>
      </files>
    </component>

    <!-- START: Infineon Standard Peripherals Low Level Drivers (XMClib)-->

    <component Cclass="Device" Cgroup="XMClib" Csub="VADC" Cversion="2.1.8" condition="XMC4 CMSIS SCU">
      <description>Versatile Analog-to-Digital Converter (VADC) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_VADC
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___v_a_d_c.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_vadc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="CAN" Cversion="2.1.8" condition="XMC4 CMSIS SCU">
      <description>Controller area network (CAN) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_CAN
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___c_a_n.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_can.c"/>
      </files>
    </component>
    
