taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC4000_DFP.2.7.1.pdsc
    <component Cclass="Device" Cgroup="XMClib" Csub="RTC" Cversion="2.1.8" condition="XMC4 CMSIS SCU">
      <description>Real Time Clock (RTC) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_RTC
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___r_t_c.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_rtc.c"/>
        <file category="source" name="Device/XMClib/src/xmc4_rtc.c"/>
      </files>
    </component>
    
     <component Cclass="Device" Cgroup="XMClib" Csub="SCU" Cversion="2.1.8" condition="XMC4 CMSIS">
      <description>System Control Unit (SCU) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_SCU
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___s_c_u.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc4_scu.c"/>
      </files>
    </component>

     <component Cclass="Device" Cgroup="XMClib" Csub="SDMMC" Cversion="2.1.8" condition="XMC4 CMSIS SCU">
      <description>Secure Digital/Multi Media Card (Interface) (SDMMC) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_SDMMC
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___s_d_m_m_c.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_sdmmc.c"/>
      </files>
    </component>
    
     <component Cclass="Device" Cgroup="XMClib" Csub="SPI" Cversion="2.1.8" condition="XMC4 CMSIS SCU">
      <description>Serial Peripheral Interface (SPI) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_SPI
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___s_p_i.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_usic.c"/>
        <file category="source" name="Device/XMClib/src/xmc_spi.c"/>
      </files>
    </component>

     <component Cclass="Device" Cgroup="XMClib" Csub="UART" Cversion="2.1.8" condition="XMC4 CMSIS SCU">
      <description>Universal Asynchronous Receiver Transmitter (UART) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_UART
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___u_a_r_t.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_usic.c"/>
        <file category="source" name="Device/XMClib/src/xmc_uart.c"/>
      </files>
    </component>

     <component Cclass="Device" Cgroup="XMClib" Csub="USB" Cversion="2.1.8" condition="XMC4 CMSIS SCU">
      <description>Universal Serial Bus (USB) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_USB
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___u_s_b_d.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_usbd.c"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="XMClib" Csub="WDT" Cversion="2.1.8" condition="XMC4 CMSIS SCU">
      <description> Watchdog Timer (WDT) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_WDT
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___w_d_t.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_wdt.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="FCE" Cversion="2.1.8" condition="XMC4 CMSIS SCU">
      <description> Flexible CRC Engine (FCE) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_FCE
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___f_c_e.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_fce.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="FLASH" Cversion="2.1.8" condition="XMC4 CMSIS SCU">
      <description> Flash Driver (FLASH) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_FLASH
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___f_l_a_s_h.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc4_flash.c"/>
      </files>
    </component>                              
    
    <!-- END: Infineon Standard Peripherals Low Level Drivers -->

    <!-- START: CMSIS Peripherals Drivers -->
        
    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.01" Cversion="2.04" condition="XMC4 CMSIS Driver Ethernet MAC">
      <description>Ethernet MAC Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_ETH_MAC
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/ETH_MAC.c"/>        
      </files>
    </component>
    
    <component Cclass="CMSIS Driver" Cgroup="Ethernet PHY" Csub="KSZ8031" Capiversion="2.00" Cversion="1.00" condition="XMC4 CMSIS">
      <!-- short component description -->
      <description>Ethernet PHY KSZ8031 Driver</description>
      <RTE_Components_h>
        #define RTE_Drivers_PHY_KSZ8031        /* Driver PHY KSZ8031 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/ETH_PHY_KSZ8031.c"/>
      </files>
    </component>

