taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC4000_DFP.2.7.1.pdsc
    <component Cclass="CMSIS Driver" Cgroup="Ethernet PHY" Csub="KSZ8081" Capiversion="2.00" Cversion="1.00" condition="XMC4 CMSIS">
      <!-- short component description -->
      <description>Ethernet PHY KSZ8081 Driver</description>
      <RTE_Components_h>
        #define RTE_Drivers_PHY_KSZ8081        /* Driver PHY KSZ8081 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/ETH_PHY_KSZ8081.c"/>
      </files>
    </component>
    
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="USB" Capiversion="2.01" Cversion="2.05" condition="XMC4 CMSIS Driver USBD">
      <description>USB Device Driver for the XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBD
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="USB" Capiversion="2.01" Cversion="1.00" condition="XMC4 CMSIS Driver USBH">
      <description>USB Host Driver for the XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBH.c"/>
      </files>
    </component>
    
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.02" Cversion="2.05" condition="XMC4 CMSIS Driver I2C">
      <description>I2C Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_I2C                
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2C.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.01" Cversion="2.06" condition="XMC4 CMSIS Driver SPI">
      <description>SPI Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_SPI
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SPI.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.01" Cversion="2.07" condition="XMC4 CMSIS Driver USART">
      <description>USART Driver for XMC4000 Family</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART              
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/UART.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.00" Cversion="1.00" condition="XMC4 CMSIS Driver SAI">
      <description>SAI Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_SAI
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SAI.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="CAN" Capiversion="1.00" Cversion="1.00" condition="XMC4 CMSIS Driver CAN">
      <description>CAN Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_CAN
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/CAN.c"/>
      </files>
    </component>   

    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.02" Cversion="1.00" condition="XMC4 CMSIS Driver MCI">
      <description>MCI Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_MCI
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/MCI.c"/>
      </files>
    </component>   
    
    <!-- END: CMSIS Peripherals Drivers -->

    <!-- Board Support Pack (BSP) for XMC4200 Application Kit -->   
    <bundle Cbundle="XMC4200 Application Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC4200 Application Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_CPU_Board_XMC4200_Actuator_R1 0.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4200 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4200 Application Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4200 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4200 Application Kit/Common/Buttons.c"/>
        </files>
      </component>    
    </bundle>

    <!-- Board Support Pack (BSP) for XMC4300 Relax Kit -->   
    <bundle Cbundle="XMC4300 Relax Kit" Cclass="Board Support" Cversion="1.0.1">
      <description>XMC4300 Relax Kit Board Support</description>    
      <doc>Documents/Infineon-User_Manual_XMC4300_Relax_Kit.pdf-UM-v01_01-EN.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4300 Relax Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4300 Relax Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4300 Relax Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4300 Relax Kit/Common/Buttons.c"/>
        </files>
      </component>    
    </bundle>

    <!-- Board Support Pack (BSP) for XMC4400 Application Kit -->   
    <bundle Cbundle="XMC4400 Application Kit" Cclass="Board Support" Cversion="1.0.1">
      <description>XMC4400 Application Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_CPU_Board_XMC4400_General_Purpose_R1 0.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4400 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4400 Application Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL SCU GPIO ERU">
        <description>Button driver for XMC4400 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4400 Application Kit/Common/Buttons.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" condition="XMC4 HAL VADC">
        <description>A/D Converter interface for XMC4400 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4400 Application Kit/Common/ADC.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Cvariant="SPI IF" condition="XMC4 CMSIS Driver SPI">
        <description>emWin LCD SPI Interface for XMC4400 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4400 Application Kit/Common/LCD_X.c"/>
          <file category="source" name="Boards/Infineon/XMC4400 Application Kit/Common/LCDConf.c"/>
        </files>
      </component>       
    </bundle>

